In [1]:
stud_data = {input("Enter The 1st Key Name :"):input("\nEnter The Values :").split(),
            input("\nEnter The 2nd Key Name :"):input("\nEnter The Values :").split(),
            input("Enter The 3rd Key Name :"):input("\nEnter The Values :").split(),
            input("Enter The 4th Key Name :"):input("\nEnter The Values :").split(),
            input("Enter The 5th Key Name :"):input("\nEnter The Values :").split(),}

print(stud_data)

Enter The 1st Key Name :Stud_Name

Enter The Values :Derek Ria Marcus Mark Jenny

Enter The 2nd Key Name :Stud_Address

Enter The Values :Jaipur Texas Dublin Napier Dublin
Enter The 3rd Key Name :Domain

Enter The Values :EE ME CS IT ESE
Enter The 4th Key Name :Gender

Enter The Values :M F M M F
Enter The 5th Key Name :Contact

Enter The Values :909087875 809087875 779087875 659087875 929087875
{'Stud_Name': ['Derek', 'Ria', 'Marcus', 'Mark', 'Jenny'], 'Stud_Address': ['Jaipur', 'Texas', 'Dublin', 'Napier', 'Dublin'], 'Domain': ['EE', 'ME', 'CS', 'IT', 'ESE'], 'Gender': ['M', 'F', 'M', 'M', 'F'], 'Contact': ['909087875', '809087875', '779087875', '659087875', '929087875']}

In [2]:
## How To Make DataFrame Using Dictionay

In [3]:
## USE : Pandas

In [4]:
## Step 1 :  import pandas

In [5]:
import pandas as pd

# Create A DataFrame : use ==> pd.DataFrame(dict_name)

df = pd.DataFrame(stud_data)

df

  Stud_Name Stud_Address Domain Gender    Contact
0     Derek       Jaipur     EE      M  909087875
1       Ria        Texas     ME      F  809087875
2    Marcus       Dublin     CS      M  779087875
3      Mark       Napier     IT      M  659087875
4     Jenny       Dublin    ESE      F  929087875

In [7]:
df["Stud_Name"]

0     Derek
1       Ria
2    Marcus
3      Mark
4     Jenny
Name: Stud_Name, dtype: object

In [8]:
df["Stud_Name"][3] = input("Enter The Update Name :")
df["Gender"][3] = input("\nEnter The Value :")
df

Enter The Update Name :Kaira

Enter The Value :F

  Stud_Name Stud_Address Domain Gender    Contact
0     Derek       Jaipur     EE      M  909087875
1       Ria        Texas     ME      F  809087875
2    Marcus       Dublin     CS      M  779087875
3     Kaira       Napier     IT      F  659087875
4     Jenny       Dublin    ESE      F  929087875

In [9]:
pip install datatable

Collecting datatable
  Downloading datatable-1.0.0-cp39-cp39-win_amd64.whl (4.0 MB)
Installing collected packages: datatable
Successfully installed datatable-1.0.0
Note: you may need to restart the kernel to use updated packages.

In [10]:
import datatable as dt

In [11]:
frame1 = dt.Frame(stud_data)

frame1